app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'passenger1@gmail.com' LIMIT 1
SELECT  `users`.* FROM `users` WHERE (driver30@gmail.com) LIMIT 1
---
  def create_token
    @user = User.find_by(email: params[:email])


    if @user.present?&&check_valid_password(@user, params[:pwd])