app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `pwd`, `usertype`, `created_at`, `updated_at`, `authentication_token`) VALUES ('passenger1@gmail.com', '123456', 'passenger', '2019-01-04 00:54:20', '2019-01-04 00:54:20', 'CjfYxrQz8ycdbn6QY8Bj')
---
  def create
    @user = User.new(user_params)

    # 잘못 입력된 usertype에 대해서 에러메시지 리턴
    return error_message_response('Please choose either passenger or driver in usertype') if @user.usertype != 'passenger' && @user.usertype != 'driver'

    # 잘못 입력된 비밀번호에 대해서 에러메시지 리턴
    return error_message_response('Password is empty') if @user.pwd.nil?

    # 6자리 미만으로 입력된 비밀번호에 대해서 에러메시지 리턴
    return error_message_response('Please write password at least 6 characters') if @user.pwd.length < 6

    if @user.save